{
  "title": "The Dhammapada",
  "subtitle": "The Buddha’s Path of Wisdom",
  "translator": "Acharya Buddharakkhita",
  "translation_note": "Translated from the Pali by Acharya Buddharakkhita",
  "copyright": "Copyright © 1985, Buddhist Publication Society Kandy, Sri Lanka",
  "license": [
    "For free distribution only.",
    "You may print copies of this work for your personal use.",
    "You may reformat and redistribute this work for use on computers and computer networks, provided that you charge no fees for its distribution or use.",
    "Otherwise, all rights reserved."
  ],
  "pages": [
    {
      "title": "Preface",
      "author": "Acharya Buddharakkhita",
      "content": [
        "The Dhammapada is the best known and most widely esteemed text in the Pali Tipitaka, the sacred scriptures of Theravada Buddhism. The work is included in the Khuddaka Nikaya (“Minor Collection”) of the Sutta Pitaka, but its popularity has raised it far above the single niche it occupies in the scriptures to the ranks of a world religious classic. Composed in the ancient Pali language, this slim anthology of verses constitutes a perfect compendium of the Buddha’s teaching, comprising between its covers all the essential principles elaborated at length in the forty-odd volumes of the Pali Canon.",
        "According to the Theravada Buddhist tradition, each verse in the Dhammapada was originally spoken by the Buddha in response to a particular episode. Accounts of these, along with exegesis of the verses, are preserved in the classic commentary to the work, compiled by the great scholiast Bhadantacariya Buddhaghosa in the fifth century C.E. on the basis or material going back to very ancient times. The contents of the verses, however. transcend the limited and particular circumstances of their origin, reaching out through the ages to various types of people in all the diverse situations of life. For the simple and unsophisticated the Dhammapada is a sympathetic counselor; for the intellectually overburdened its clear and direct teachings inspire humility and reflection; for the earnest seeker it is a perennial source of inspiration and practical instruction. Insights that flashed into the heart of the Buddha have crystallized into these luminous verses of pure wisdom. As profound expressions of practical spirituality, each verse is a guideline to right living. The Buddha unambiguously pointed out that whoever earnestly practices the teachings found in the Dhammapada will taste the bliss of emancipation.",
        "Due to its immense importance, the Dhammapada has been translated into numerous languages. In English alone several translations are available, including editions by such noted scholars as Max Muller and Dr. S. Radhakrishnan. However, when presented from a non-Buddhist frame of reference, the teachings of the Buddha inevitably suffer some distortion. This, in fact, has already happened with our anthology: an unfortunate selection of renderings has sometimes suggested erroneous interpretations, while footnotes have tended to be judgmental.",
        "The present translation was originally written in the late 1950’s. Some years earlier, while consulting a number of English-language editions of the Dhammapada, it was observed that the renderings were either too free and inaccurate or too pedantic, and it was therefore felt that a new translation avoiding these two extremes would serve a valuable purpose. The finished result of that project, presented here, is a humble attempt by a practicing follower of the Buddha to transmit the spirit and content, as well as the language and style, of the original teachings.",
        "In preparing this volume I have had access to numerous editions and translations of the Dhammapada into various languages, including Sanskrit, Hindi, Bengali, Sinhala, Burmese and Nepali. I particularly benefited from the excellent translations of the work by the late Venerable Narada Mahathera of Vajirarama, Colombo. Sri Lanka, and Professor Bhagwat of Poona, India; To them I acknowledge my debt. A few verses contain riddles, references or analogies that may not be evident to the reader. The meanings of these are provided either in parenthesis or notes, and for their interpretation I have relied on the explanations given in Bhadantacariya Buddhaghosa’s commentary. Verses discussed in the notes are indicated in the text by an asterisk at the end of the verse.",
        "A first edition of this translation was published in 1959 and a second in 1966, both by the Maha Bodhi Society in Bangalore, India. For this third edition, the translation has undergone considerable revision. The newly added subtitle, “The Buddha’s Path of Wisdom,” is not literal, but is fully applicable on the ground that the verses of the Dhammapada all originate from the Buddha’s wisdom and lead the one who follows them to a life guided by that same wisdom.",
        "I am grateful to the editors of the Buddhist Publication Society for their helpful suggestions. and to the Society itself for so generously undertaking the publication of this work.",
        "I make this offering of Dhamma in grateful memory of my teachers, parents and relatives, departed and living. May they find access in the Buddha’s Dispensation and attain Nibbana!",
        "May all beings be happy!"
      ]
    },
    {
      "title": "Introduction",
      "author": "Bhikkhu Bodhi",
      "content": [
        "From ancient times to the present, the Dhammapada has been regarded as the most succinct expression of the Buddha’s teaching found in the Pali Canon and the chief spiritual testament of early Buddhism. In the countries following Theravada Buddhism, such as Sri Lanka, Burma and Thailand, the influence of the Dhammapada is ubiquitous. It is an ever-fecund source of themes for sermons and discussions, a guidebook for resolving the countless problems of everyday life, a primer for the instruction of novices in the monasteries. Even the experienced contemplative, withdrawn to forest hermitage or mountainside cave for a life of meditation, can be expected to count a copy of the book among his few material possessions. Yet the admiration the Dhammapada has elicited has not been confined to avowed followers of Buddhism. Wherever it has become known its moral earnestness, realistic understanding of human life, aphoristic wisdom and stirring message of a way to freedom from suffering have won for it the devotion and veneration of those responsive to the good and the true.",
        "The expounder of the verses that comprise the Dhammapada is the Indian sage called the Buddha, an honorific title meaning “the Enlightened One” or “the Awakened One.” The story of this venerable personage has often been overlaid with literary embellishment and the admixture of legend, but the historical essentials of his life are simple and clear. He was born in the sixth century B.C., the son of a king ruling over a small state in the Himalayan foothills, in what is now Nepal. His given name was Siddhattha and his family name Gotama (Sanskrit: Siddhartha Gautama). Raised in luxury, groomed by his father to be the heir to the throne, in his early manhood he went through a deeply disturbing encounter with the sufferings of life, as a result of which he lost all interest in the pleasures and privileges of rulership. One night, in his twenty-ninth year, he fled the royal city and entered the forest to live as an ascetic, resolved to find a way to deliverance from suffering. For six years he experimented with different systems of meditation and subjected himself to severe austerities, but found that these practices did not bring him any closer to his goal. Finally, in his thirty-fifth year, while sitting in deep meditation beneath a tree at Gaya, he attained Supreme Enlightenment and became, in the proper sense of the title, the Buddha, the Enlightened One. Thereafter, for forty-five years, he traveled throughout northern India, proclaiming the truths he had discovered and founding an order of monks and nuns to carry on his message. At the age of eighty, after a long and fruitful life, he passed away peacefully in the small town of Kusinara, surrounded by a large number of disciples.",
        "To his followers, the Buddha is neither a god, a divine incarnation, or a prophet bearing a message of divine revelation, but a human being who by his own striving and intelligence has reached the highest spiritual attainment of which man is capable – perfect wisdom, full enlightenment, complete purification of mind. His function in relation to humanity is that of a teacher – a world teacher who, out of compassion, points out to others the way to Nibbana (Sanskrit: Nirvana), final release from suffering. His teaching, known as the Dhamma, offers a body of instructions explaining the true nature of existence and showing the path that leads to liberation. Free from all dogmas and inscrutable claims to authority, the Dhamma is founded solidly upon the bedrock of the Buddha’s own clear comprehension of reality, and it leads the one who practices it to that same understanding – the knowledge which extricates the roots of suffering.",
        "The title “Dhammapada” which the ancient compilers of the Buddhist scriptures attached to our anthology means portions, aspects, or sections of Dhamma. The work has been given this title because, in its twenty-six chapters, it spans the multiple aspects of the Buddha’s teaching, offering a variety of standpoints from which to gain a glimpse into its heart. Whereas the longer discourses of the Buddha contained in the prose sections of the Canon usually proceed methodically, unfolding according to the sequential structure of the doctrine, the Dhammapada lacks such a systematic arrangement. The work is simply a collection of inspirational or pedagogical verses on the fundamentals of the Dhamma, to be used as a basis for personal edification and instruction. In any given chapter several successive verses may have been spoken by the Buddha on a single occasion, and thus among themselves will exhibit a meaningful development or a set of variations on a theme. But by and large, the logic behind the grouping together of verses into a chapter is merely the concern with a common topic. The twenty-six chapter headings thus function as a kind of rubric for classifying the diverse poetic utterances of the Master, and the reason behind the inclusion of any given verse in a particular chapter is its mention of the subject indicated in the chapter’s heading. In some cases (Chapters 4 and 23) this may be a metaphorical symbol rather than a point of doctrine. There also seems to be no intentional design in the order of the chapters themselves, though at certain points a loose thread of development can be discerned.",
        "The teachings of the Buddha, viewed in their completeness, all link together into a single perfectly coherent system of thought and practice which gains its unity from its final goal, the attainment of deliverance from suffering. But the teachings inevitably emerge from the human condition as their matrix and starting point, and thus must be expressed in such a way as to reach human beings standing at different levels of spiritual development, with their highly diverse problems, ends, and concerns and with their very different capacities for understanding. Thence, just as water, though one in essence. assumes different shapes due to the vessels into which it is poured, so the Dhamma of liberation takes on different forms in response to the needs of the beings to be taught. This diversity, evident enough already in the prose discourses, becomes even more conspicuous in the highly condensed. spontaneous and intuitively charged medium of verse used in the Dhammapada. The intensified power of delivery can result in apparent inconsistencies which may perplex the unwary. For example, in many verses the Buddha commends certain practices on the grounds that they lead to a heavenly birth, but in others he discourages disciples from aspiring for heaven and extols the one who takes no delight in celestial pleasures (187, 417) [Unless chapter numbers are indicated, all figures enclosed in parenthesis refer to verse numbers of the Dhammapada.]",
        "Often he enjoins works of merit, yet elsewhere he praises the one who has gone beyond both merit and demerit (39, 412). Without a grasp of the underlying structure of the Dhamma, such statements viewed side by side will appear incompatible and may even elicit the judgment that the teaching is self-contradictory.",
        "The key to resolving these apparent discrepancies is the recognition that the Dhamma assumes its formulation from the needs of the diverse persons to whom it is addressed, as well as from the diversity of needs that may co-exist even in a single individual. To make sense of the various utterances found in the Dhammapada, we will suggest a schematism of four levels to be used for ascertaining the intention behind any particular verse found in the work, and thus for understanding its proper place in the total systematic vision of the Dhamma. This fourfold schematism develops out of an ancient interpretive maxim which holds that the Buddha’s teaching is designed to meet three primary aims: human welfare here and now, a favorable rebirth in the next life, and the attainment of the ultimate good. The four levels are arrived at by distinguishing the last aim into two stages: path and fruit.",
        "(i) The first level is the concern with establishing well-being and happiness in the immediately visible sphere of concrete human relations. The aim at this level is to show man the way to live at peace with himself and his fellow men, to fulfill his family and social responsibilities, and to restrain the bitterness, conflict and violence which infect human relationships and bring such immense suffering to the individual, society, and the world as a whole. The guidelines appropriate to this level are largely identical with the basic ethical injunctions proposed by most of the great world religions, but in the Buddhist teaching they are freed from theistic moorings and grounded upon two directly verifiable foundations: concern for one’s own integrity and long-range happiness and concern for the welfare of those whom one’s actions may affect (129-132). The most general counsel the Dhammapada gives is to avoid all evil, to cultivate good and to cleanse one’s mind (183). But to dispel any doubts the disciple might entertain as to what he should avoid and what he should cultivate, other verses provide more specific directives. One should avoid irritability in deed, word and thought and exercise self-control (231-234). One should adhere to the five precepts, the fundamental moral code of Buddhism, which teach abstinence from destroying life, from stealing, from committing adultery, from speaking lies and from taking intoxicants; one who violates these five training rules “digs up his own root even in this very world” (246-247). The disciple should treat all beings with kindness and compassion, live honestly and righteously, control his sensual desires, speak the truth and live a sober upright life, diligently fulfilling his duties, such as service to parents, to his immediate family and to those recluses and brahmins who depend on the laity for their maintenance (332-333).",
        "A large number of verses pertaining to this first level are concerned with the resolution of conflict and hostility. Quarrels are to be avoided by patience and forgiveness, for responding to hatred by further hatred only maintains the cycle of vengeance and retaliation. The true conquest of hatred is achieved by non-hatred, by forbearance, by love (4-6). One should not respond to bitter speech but maintain silence (134). One should not yield to anger but control it as a driver controls a chariot (222). Instead of keeping watch for the faults of others, the disciple is admonished to examine his own faults, and to make a continual effort to remove his impurities just as a silversmith purifies silver (50, 239). Even if he has committed evil in the past, there is no need for dejection or despair; for a man’s ways can be radically changed, and one who abandons the evil for the good illuminates this world like the moon freed from clouds (173).",
        "The sterling qualities distinguishing the man of virtue are generosity, truthfulness, patience, and compassion (223). By developing and mastering these qualities within himself, a man lives at harmony with his own conscience and at peace with his fellow beings. The scent of virtue, the Buddha declares, is sweeter than the scent of all flowers and perfumes (55-56). The good man, like the Himalaya mountains, shines from afar, and wherever he goes he is loved and respected (303-304).",
        "(ii) In its second level of teaching, the Dhammapada shows that morality does not exhaust its significance in its contribution to human felicity here and now, but exercises a far more critical influence in molding personal destiny. This level begins with the recognition that, to reflective thought, the human situation demands a more satisfactory context for ethics than mere appeals to altruism can provide. On the one hand our innate sense of moral justice requires that goodness be recompensed with happiness and evil with suffering; on the other our typical experience shows us virtuous people beset with hardships and afflictions and thoroughly bad people riding the waves of fortune (119-120). Moral intuition tells us that if there is any long-range value to righteousness, the imbalance must somehow be redressed. The visible order does not yield an evident solution, but the Buddha’s teaching reveals the factor needed to vindicate our cry for moral justice in an impersonal universal law which reigns over all sentient existence. This is the law of kamma (Sanskrit: karma), of action and its fruit, which ensures that morally determinate action does not disappear into nothingness but eventually meets its due retribution, the good with happiness, the bad with suffering.",
        "In the popular understanding kamma is sometimes identified with fate, but this is a total misconception utterly inapplicable to the Buddhist doctrine. Kamma means volitional action, action springing from intention, which may manifest itself outwardly as bodily deeds or speech, or remain internally as unexpressed thoughts, desires and emotions. The Buddha distinguishes kamma into two primary ethical types: unwholesome kamma, action rooted in mental states of greed, hatred and delusion; and wholesome kamma. action rooted in mental states of generosity or detachment, goodwill and understanding. The willed actions a person performs in the course of his life may fade from memory without a trace, but once performed they leave subtle imprints on the mind, seeds with the potential to come to fruition in the future when they meet conditions conducive to their ripening.",
        "The objective field in which the seeds of kamma ripen is the process of rebirths called samsara. In the Buddha’s teaching, life is not viewed as an isolated occurrence beginning spontaneously with birth and ending in utter annihilation at death. Each single life span is seen, rather, as part of an individualized series of lives having no discoverable beginning in time and continuing on as long as the desire for existence stands intact. Rebirth can take place in various realms. There are not only the familiar realms of human beings and animals, but ranged above we meet heavenly worlds of greater happiness, beauty and power, and ranged below infernal worlds of extreme suffering.",
        "The cause for rebirth into these various realms the Buddha locates in kamma, our own willed actions. In its primary role, kamma determines the sphere into which rebirth takes place, wholesome actions bringing rebirth in higher forms, unwholesome actions rebirth in lower forms. After yielding rebirth, kamma continues to operate, governing the endowments and circumstances of the individual within his given form of existence. Thus, within the human world, previous stores of wholesome kamma will issue in long life, health, wealth, beauty and success; stores of unwholesome kamma in short life, illness, poverty, ugliness and failure.",
        "Prescriptively, the second level of teaching found in the Dhammapada is the practical corollary to this recognition of the law of kamma, put forth to show human beings, who naturally desire happiness and freedom from sorrow, the effective means to achieve their objectives. The content of this teaching itself does not differ from that presented at the first level; it is the same set of ethical injunctions for abstaining from evil and for cultivating the good. The difference lies in the perspective from which the injunctions are issued and the aim for the sake of which they are to be taken up. The principles of morality are shown now in their broader cosmic connections, as tied to an invisible but all-embracing law which binds together all life and holds sway over the repeated rotations of the cycle of birth and death. The observance of morality is justified, despite its difficulties and apparent failures, by the fact that it is in harmony with that law, that through the efficacy of kamma, our willed actions become the chief determinant of our destiny both in this life and in future states of becoming. To follow the ethical law leads upwards – to inner development, to higher rebirths and to richer experiences of happiness and joy. To violate the law, to act in the grip of selfishness and hate, leads downwards – to inner deterioration, to suffering and to rebirth in the worlds of misery. This theme is announced already by the pair of verses which opens the Dhammapada, and reappears in diverse formulations throughout the work (see, e.g., 15-18, 117-122, 127, 132-133, Chapter 22).",
        "(iii) The ethical counsel based on the desire for higher rebirths and happiness in future lives is not the final teaching of the Buddha, and thus cannot provide the decisive program of personal training commended by the Dhammapada. In its own sphere of application, it is perfectly valid as a preparatory or provisional teaching for those whose spiritual faculties are not yet ripe but still require further maturation over a succession of lives. A deeper, more searching examination, however, reveals that all states of existence in samsara, even the loftiest celestial abodes, are lacking in genuine worth; for they are all inherently impermanent, without any lasting substance, and thus, for those who cling to them, potential bases for suffering. The disciple of mature faculties, sufficiently prepared by previous experience for the Buddha’s distinctive exposition of the Dhamma, does not long even for rebirth among the gods. Having understood the intrinsic inadequacy of all conditioned things, his focal aspiration is only for deliverance from the ever-repeating round of births. This is the ultimate goal to which the Buddha points, as the immediate aim for those of developed faculties and also as the long-term ideal for those in need of further development: Nibbana, the Deathless, the unconditioned state where there is no more birth, aging and death, and no more suffering.",
        "The third level of teaching found in the Dhammapada sets forth the theoretical framework and practical discipline emerging out of the aspiration for final deliverance. The theoretical framework is provided by the teaching of the Four Noble Truths (190-192, 273), which the Buddha had proclaimed already in his first sermon and upon which he placed so much stress in his many discourses that all schools of Buddhism have appropriated them as their common foundation. The four truths all center around the fact of suffering (dukkha), understood not as mere experienced pain and sorrow, but as the pervasive unsatisfactoriness of everything conditioned (202-203). The first truth details the various forms of suffering – birth, old age, sickness and death, the misery of unpleasant encounters and painful separations, the suffering of not obtaining what one wants. It culminates in the declaration that all constituent phenomena of body and mind, “the aggregates of existence” (khandha), being impermanent and substanceless, are intrinsically unsatisfactory. The second truth points out that the cause of suffering is craving (tanha), the desire for pleasure and existence which drives us through the round of rebirths, bringing in its trail sorrow, anxiety, and despair (212-216, Chapter 24). The third truth declares that the destruction of craving issues in release from suffering, and the fourth prescribes the means to gain release, the Noble Eightfold Path: right understanding, right thought, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration (Chapter 20).",
        "If, at this third level, the doctrinal emphasis shifts from the principles of kamma and rebirth to the Four Noble Truths, a corresponding shift in emphasis takes place in the practical sphere as well. The stress now no longer falls on the observation of basic morality and the cultivation of wholesome attitudes as a means to higher rebirths. Instead it falls on the integral development of the Noble Eightfold Path as the means to uproot the craving that nurtures the process of rebirth itself. For practical purposes the eight factors of the path are arranged into three major groups which reveal more clearly the developmental structure of the training: moral discipline (including right speech, right action and right livelihood), concentration (including right effort, right mindfulness and right concentration), and wisdom (including right understanding and right thought). By the training in morality, the coarsest forms of the mental defilements, those erupting as unwholesome deeds and words, are checked and kept under control. By the training in concentration the mind is made calm, pure and unified, purged of the currents of distractive thoughts. By the training in wisdom the concentrated beam of attention is focused upon the constituent factors of mind and body to investigate and contemplate their salient characteristics. This wisdom, gradually ripened, climaxes in the understanding that brings complete purification and deliverance of mind.",
        "In principle, the practice of the path in all three stages is feasible for people in any walk of life. The Buddha taught it to laypeople as well as to monks, and many of his lay followers reached high stages of attainment. However, application to the development of the path becomes most fruitful for those who have relinquished all other concerns in order to devote themselves wholeheartedly to spiritual training, to living the “holy life” (brahmacariya). For conduct to be completely purified, for sustained contemplation and penetrating wisdom to unfold without impediments, adoption of a different style of life becomes imperative, one which minimizes distractions and stimulants to craving and orders all activities around the aim of liberation. Thus the Buddha established the Sangha, the order of monks and nuns, as the special field for those ready to dedicate their lives to the practice of his path, and in the Dhammapada the call to the monastic life resounds throughout.",
        "The entry-way to the monastic life is an act of radical renunciation. The thoughtful, who have seen the transience and hidden misery of worldly life, break the ties of family and social bonds, abandon their homes and mundane pleasures, and enter upon the state of homelessness (83, 87-89, 91). Withdrawn to silent and secluded places, they seek out the company of wise instructors, and guided by the rules of the monastic training, devote their energies to a life of meditation. Content with the simplest material requisites, moderate in eating, restrained in their senses, they stir up their energy, abide in constant mindfulness and still the restless waves of thoughts (185, 375). With the mind made clear and steady, they learn to contemplate the arising and falling away of all formations, and experience thereby “a delight that transcends all human delights,” a joy and happiness that anticipates the bliss of the Deathless (373-374). The life of meditative contemplation reaches its peak in the development of insight (vipassana), and the Dhammapada enunciates the principles to be discerned by insight-wisdom: that all conditioned things are impermanent, that they are all unsatisfactory, that there is no self or truly existent ego entity to be found in anything whatsoever (277-279). When these truths are penetrated by direct experience, the craving, ignorance and related mental fetters maintaining bondage break asunder, and the disciple rises through successive stages of realization to the full attainment of Nibbana.",
        "(iv) The fourth level of teaching in the Dhammapada provides no new disclosure of doctrine or practice, but an acclamation and exaltation of those who have reached the goal. In the Pali Canon the stages of definite attainment along the way to Nibbana are enumerated as four. At the first, called “Stream-entry” (sotapatti), the disciple gains his first glimpse of “the Deathless” and enters irreversibly upon the path to liberation, bound to reach the goal in seven lives at most. This achievement alone, the Dhammapada declares, is greater than lordship over all the worlds (178). Following Stream-entry come two further stages which weaken and eradicate still more defilements and bring the goal increasingly closer to view. One is called the stage of Once-returner (sakadagami), when the disciple will return to the human world at most only one more time; the other the stage of Non-returner (anagami), when he will never come back to human existence but will take rebirth in a celestial plane, bound to win final deliverance there. The fourth and final stage is that of the Arahat, the Perfected One, the fully accomplished sage who has completed the development of the path, eradicated all defilements and freed himself from bondage to the cycle of rebirths. This is the ideal figure of early Buddhism and the supreme hero of the Dhammapada. Extolled in Chapter 7 under his own name and in Chapter 26 (385-388, 396-423) under the name brahmana, “holy man,” the Arahat serves as a living demonstration of the truth of the Dhamma. Bearing his last body, perfectly at peace, he is the inspiring model who shows in his own person that it is possible to free oneself from the stains of greed, hatred and delusion, to rise above suffering, to win Nibbana in this very life.",
        "The Arahat ideal reaches its optimal exemplification in the Buddha, the promulgator and master of the entire teaching. It was the Buddha who. without any aid or guidance, rediscovered the ancient path to deliverance and taught it to countless others. His arising in the world provides the precious opportunity to hear and practice the excellent Dhamma (182, 194). He is the giver and shower of refuge (190-192), the Supreme Teacher who depends on nothing but his own self-evolved wisdom (353). Born a man, the Buddha always remains essentially human, yet his attainment of Perfect Enlightenment elevates him to a level far surpassing that of common humanity. All our familiar concepts and modes of knowing fail to circumscribe his nature: he is trackless, of limitless range, free from all worldliness, the conqueror of all, the knower of all, untainted by the world (179, 180, 353).",
        "Always shining in the splendor of his wisdom, the Buddha by his very being confirms the Buddhist faith in human perfectibility consummates the Dhammapada’s picture of man perfected, the Arahat.",
        "The four levels of teaching just discussed give us the key for sorting out the Dhammapada’s diverse utterances on Buddhist doctrine and for discerning the intention behind its words of practical counsel. Interlaced with the verses specific to these four main levels, there runs throughout the work a large number of verses not tied to any single level but applicable to all alike. Taken together, these delineate for us the basic world view of early Buddhism. The most arresting feature of this view is its stress on process rather than persistence as the defining mark of actuality. The universe is in flux, a boundless river of incessant becoming sweeping everything along; dust motes and mountains, gods and men and animals, world system after world system without number – all are engulfed by the irrepressible current. There is no creator of this process, no providential deity behind the scenes steering all things to some great and glorious end. The cosmos is beginningless, and in its movement from phase to phase it is governed only by the impersonal, implacable law of arising, change, and passing away.",
        "However, the focus of the Dhammapada is not on the outer cosmos, but on the human world, upon man with his yearning and his suffering. his immense complexity, his striving and movement towards transcendence. The starting point is the human condition as given, and fundamental to the picture that emerges is the inescapable duality of human life, the dichotomies which taunt and challenge man at every turn. Seeking happiness, afraid of pain, loss and death, man walks the delicate balance between good and evil, purity and defilement, progress and decline. His actions are strung out between these moral antipodes, and because he cannot evade the necessity to choose, he must bear the full responsibility for his decisions. Man’s moral freedom is a reason for both dread and jubilation, for by means of his choices he determines his own individual destiny, not only through one life, but through the numerous lives to be turned up by the rolling wheel of samsara. If he chooses wrongly he can sink to the lowest depths of degradation, if he chooses rightly he can make himself worthy even of the homage of the gods. The paths to all destinations branch out from the present, from the ineluctable immediate occasion of conscious choice and action.",
        "The recognition of duality extends beyond the limits of conditioned existence to include the antithetical poles of the conditioned and the unconditioned, samsara and Nibbana, the “near shore” and the “far shore.” The Buddha appears in the world as the Great Liberator who shows man the way to break free from the one and arrive at the other, where alone true safety is to be found. But all he can do is indicate the path; the work of treading it lies in the hands of the disciple. The Dhammapada again and again sounds this challenge to human freedom: man is the maker and master of himself, the protector or destroyer of himself, the savior of himself (160, 165, 380). In the end he must choose between the way that leads back into the world, to the round of becoming, and the way that leads out of the world, to Nibbana. And though this last course is extremely difficult and demanding, the voice of the Buddha speaks words of assurance confirming that it can be done, that it lies within man’s power to overcome all barriers and to triumph even over death itself.",
        "The pivotal role in achieving progress in all spheres, the Dhammapada declares, is played by the mind. In contrast to the Bible, which opens with an account of God’s creation of the world, the Dhammapada begins with an unequivocal assertion that mind is the forerunner of all that we are, the maker of our character, the creator of our destiny. The entire discipline of the Buddha, from basic morality to the highest levels of meditation, hinges upon training the mind. A wrongly directed mind brings greater harm than any enemy, a rightly directed mind brings greater good than any other relative or friend (42, 43). The mind is unruly, fickle, difficult to subdue, but by effort, mindfulness and unflagging self-discipline, one can master its vagrant tendencies, escape the torrents of the passions and find “an island which no flood can overwhelm” (25). The one who conquers himself, the victor over his own mind, achieves a conquest which can never be undone, a victory greater than that of the mightiest warriors (103-105).",
        "What is needed most urgently to train and subdue the mind is a quality called heedfulness (appamada). Heedfulness combines critical self awareness and unremitting energy in a process of keeping the mind under constant observation to detect and expel the defiling impulses whenever they seek an opportunity to surface. In a world where man has no savior but himself, and where the means to his deliverance lies in mental purification, heedfulness becomes the crucial factor for ensuring that the aspirant keeps to the straight path of training without deviating due to the seductive allurements of sense pleasures or the stagnating influences of laziness and complacency. Heedfulness, the Buddha declares, is the path to the Deathless; heedlessness, the path to death. The wise who understand this distinction abide in heedfulness and experience Nibbana, “the incomparable freedom from bondage” (21-23).",
        "As a great religious classic and the chief spiritual testament of early Buddhism, the Dhammapada cannot be gauged in its true value by a single reading, even if that reading is done carefully and reverentially. It yields its riches only through repeated study, sustained reflection, and most importantly, through the application of its principles to daily life. Thence it might be suggested to the reader in search of spiritual guidance that the Dhammapada be used as a manual for contemplation. After his initial reading, he would do well to read several verses or even a whole chapter every day, slowly and carefully, relishing the words. He should reflect on the meaning of each verse deeply and thoroughly, investigate its relevance to his life, and apply it as a guide to conduct. If this is done repeatedly, with patience and perseverance, it is certain that the Dhammapada will confer upon his life a new meaning and sense of purpose. Infusing him with hope and inspiration, gradually it will lead him to discover a freedom and happiness far greater than anything the world can offer."
      ]
    }
  ],
  "chapters": [
    {
      "title": "The Pairs",
      "verses": [
        { "no": "1", "verse": "Mind precedes all mental states. Mind is their chief; they are all mind-wrought. If with an impure mind a person speaks or acts suffering follows him like the wheel that follows the foot of the ox." },
        { "no": "2", "verse": "Mind precedes all mental states. Mind is their chief; they are all mind-wrought. If with a pure mind a person speaks or acts happiness follows him like his never-departing shadow." },
        { "no": "3", "verse": "“He abused me, he struck me, he overpowered me, he robbed me.” Those who harbor such thoughts do not still their hatred." },
        { "no": "4", "verse": "“He abused me, he struck me, he overpowered me, he robbed me.” Those who do not harbor such thoughts still their hatred." },
        { "no": "5", "verse": "Hatred is never appeased by hatred in this world. By non-hatred alone is hatred appeased. This is a law eternal." },
        { "no": "6", "verse": "There are those who do not realize that one day we all must die. But those who do realize this settle their quarrels." },
        { "no": "7", "verse": "Just as a storm throws down a weak tree, so does Mara overpower the man who lives for the pursuit of pleasures, who is uncontrolled in his senses, immoderate in eating, indolent, and dissipated.", "footnote": "Mara: the Tempter in Buddhism, represented in the scriptures as an evil-minded deity who tries to lead people from the path to liberation. The commentaries explain Mara as the lord of evil forces, as mental defilements and as death." },
        { "no": "8", "verse": "Just as a storm cannot prevail against a rocky mountain, so Mara can never overpower the man who lives meditating on the impurities, who is controlled in his senses, moderate in eating, and filled with faith and earnest effort.", "footnote": "The impurities (asubha): subjects of meditation which focus on the inherent repulsiveness of the body, recommended especially as powerful antidotes to lust." },
        { "no": "9", "verse": "Whoever being depraved, devoid of self-control and truthfulness, should don the monk’s yellow robe, he surely is not worthy of the robe." },
        { "no": "10", "verse": "But whoever is purged of depravity, well-established in virtues and filled with self-control and truthfulness, he indeed is worthy of the yellow robe." },
        { "no": "11", "verse": "Those who mistake the unessential to be essential and the essential to be unessential, dwelling in wrong thoughts, never arrive at the essential." },
        { "no": "12", "verse": "Those who know the essential to be essential and the unessential to be unessential, dwelling in right thoughts, do arrive at the essential." },
        { "no": "13", "verse": "Just as rain breaks through an ill-thatched house, so passion penetrates an undeveloped mind." },
        { "no": "14", "verse": "Just as rain does not break through a well-thatched house, so passion never penetrates a well-developed mind." },
        { "no": "15", "verse": "The evil-doer grieves here and hereafter; he grieves in both the worlds. He laments and is afflicted, recollecting his own impure deeds." },
        { "no": "16", "verse": "The doer of good rejoices here and hereafter; he rejoices in both the worlds. He rejoices and exults, recollecting his own pure deeds." },
        { "no": "17", "verse": "The evil-doer suffers here and hereafter; he suffers in both the worlds. The thought, “Evil have I done,” torments him, and he suffers even more when gone to realms of woe." },
        { "no": "18", "verse": "The doer of good delights here and hereafter; he delights in both the worlds. The thought, “Good have I done,” delights him, and he delights even more when gone to realms of bliss." },
        { "no": "19", "verse": "Much though he recites the sacred texts, but acts not accordingly, that heedless man is like a cowherd who only counts the cows of others – he does not partake of the blessings of the holy life." },
        { "no": "20", "verse": "Little though he recites the sacred texts, but puts the Teaching into practice, forsaking lust, hatred, and delusion, with true wisdom and emancipated mind, clinging to nothing of this or any other world – he indeed partakes of the blessings of a holy life." }
      ]
    },
    {
      "title": "Heedfulness",
      "verses": [
        { "no": "21", "verse": "Heedfulness is the path to the Deathless. Heedlessness is the path to death. The heedful die not. The heedless are as if dead already.", "footnote": "The Deathless (amata): Nibbana, so called because those who attain it are free from the cycle of repeated birth and death." },
        { "no": "22", "verse": "Clearly understanding this excellence of heedfulness, the wise exult therein and enjoy the resort of the Noble Ones.", "footnote": "The Noble Ones (ariya): those who have reached any of the four stages of supramundane attainment leading irreversibly to Nibbana." },
        { "no": "23", "verse": "The wise ones, ever meditative and steadfastly persevering, alone experience Nibbana, the incomparable freedom from bondage." },
        { "no": "24", "verse": "Ever grows the glory of him who is energetic, mindful and pure in conduct, discerning and self-controlled, righteous and heedful." },
        { "no": "25", "verse": "By effort and heedfulness, discipline and self-mastery, let the wise one make for himself an island which no flood can overwhelm." },
        { "no": "26", "verse": "The foolish and ignorant indulge in heedlessness, but the wise one keeps his heedfulness as his best treasure." },
        { "no": "27", "verse": "Do not give way to heedlessness. Do not indulge in sensual pleasures. Only the heedful and meditative attain great happiness." },
        { "no": "28", "verse": "Just as one upon the summit of a mountain beholds the groundlings, even so when the wise man casts away heedlessness by heedfulness and ascends the high tower of wisdom, this sorrowless sage beholds the sorrowing and foolish multitude." },
        { "no": "29", "verse": "Heedful among the heedless, wide-awake among the sleepy, the wise man advances like a swift horse leaving behind a weak jade." },
        { "no": "30", "verse": "By Heedfulness did Indra become the overlord of the gods. Heedfulness is ever praised, and heedlessness ever despised.", "footnote": "Indra: the ruler of the gods in ancient Indian mythology." },
        { "no": "31", "verse": "The monk who delights in heedfulness and looks with fear at heedlessness advances like fire, burning all fetters, small and large." },
        { "no": "32", "verse": "The monk who delights in heedfulness and looks with fear at heedlessness will not fall. He is close to Nibbana." }
      ]
    },
    {
      "title": "The Mind",
      "verses": [
        { "no": "33", "verse": "Just as a fletcher straightens an arrow shaft, even so the discerning man straightens his mind – so fickle and unsteady, so difficult to guard." },
        { "no": "34", "verse": "As a fish when pulled out of water and cast on land throbs and quivers, even so is this mind agitated. Hence should one abandon the realm of Mara." },
        { "no": "35", "verse": "Wonderful, indeed, it is to subdue the mind, so difficult to subdue, ever swift, and seizing whatever it desires. A tamed mind brings happiness." },
        { "no": "36", "verse": "Let the discerning man guard the mind, so difficult to detect and extremely subtle, seizing whatever it desires. A guarded mind brings happiness." },
        { "no": "37", "verse": "Dwelling in the cave (of the heart), the mind, without form, wanders far and alone. Those who subdue this mind are liberated from the bonds of Mara." },
        { "no": "38", "verse": "Wisdom never becomes perfect in one whose mind is not steadfast, who knows not the Good Teaching and whose faith wavers." },
        { "no": "39", "verse": "There is no fear for an awakened one, whose mind is not sodden (by lust) nor afflicted (by hate), and who has gone beyond both merit and demerit.", "footnote": "The Arahat is said to be beyond both merit and demerit because, as he has abandoned all defilements, he can no longer perform evil actions; and as he has no more attachment, his virtuous actions no longer bear kammic fruit." },
        { "no": "40", "verse": "Realizing that this body is as fragile as a clay pot, and fortifying this mind like a well-fortified city, fight out Mara with the sword of wisdom. Then, guarding the conquest, remain unattached." },
        { "no": "41", "verse": "Ere long, alas! this body will lie upon the earth, unheeded and lifeless, like a useless log." },
        { "no": "42", "verse": "Whatever harm an enemy may do to an enemy, or a hater to a hater, an ill-directed mind inflicts on oneself a greater harm." },
        { "no": "43", "verse": "Neither mother, father, nor any other relative can do one greater good than one’s own well-directed mind." }
      ]
    },
    {
      "title": "Flowers",
      "verses": [
        { "no": "44", "verse": "Who shall overcome this earth, this realm of Yama and this sphere of men and gods? Who shall bring to perfection the well-taught path of wisdom as an expert garland-maker would his floral design?" },
        { "no": "45", "verse": "A striver-on-the path shall overcome this earth, this realm of Yama and this sphere of men and gods. The striver-on-the-path shall bring to perfection the well-taught path of wisdom, as an expert garland-maker would his floral design.", "footnote": "The Striver-on-the-Path (sekha): one who has achieved any of the first three stages of supramundane attainment: a Stream-enterer, Once-returner, or Non-returner." },
        { "no": "46", "verse": "Realizing that this body is like froth, penetrating its mirage-like nature, and plucking out Mara’s flower-tipped arrows of sensuality, go beyond sight of the King of Death!" },
        { "no": "47", "verse": "As a mighty flood sweeps away the sleeping village, so death carries away the person of distracted mind who only plucks the flowers (of pleasure)." },
        { "no": "48", "verse": "The Destroyer brings under his sway the person of distracted mind who, insatiate in sense desires, only plucks the flowers (of pleasure)." },
        { "no": "49", "verse": "As a bee gathers honey from the flower without injuring its color or fragrance, even so the sage goes on his alms-round in the village.", "footnote": "The “sage in the village” is the Buddhist monk who receives his food by going silently from door to door with his alms bowls, accepting whatever is offered." },
        { "no": "50", "verse": "Let none find fault with others; let none see the omissions and commissions of others. But let one see one’s own acts, done and undone." },
        { "no": "51", "verse": "Like a beautiful flower full of color but without fragrance, even so, fruitless are the fair words of one who does not practice them." },
        { "no": "52", "verse": "Like a beautiful flower full of color and also fragrant, even so, fruitful are the fair words of one who practices them." },
        { "no": "53", "verse": "As from a great heap of flowers many garlands can be made, even so should many good deeds be done by one born a mortal." },
        { "no": "54", "verse": "Not the sweet smell of flowers, not even the fragrance of sandal, tagara, or jasmine blows against the wind. But the fragrance of the virtuous blows against the wind. Truly the virtuous man pervades all directions with the fragrance of his virtue.", "footnote": "Tagara: a fragrant powder obtained from a particular kind of shrub." },
        { "no": "55", "verse": "Of all the fragrances – sandal, tagara, blue lotus and jasmine – the fragrance of virtue is the sweetest." },
        { "no": "56", "verse": "Faint is the fragrance of tagara and sandal, but excellent is the fragrance of the virtuous, wafting even amongst the gods." },
        { "no": "57", "verse": "Mara never finds the path of the truly virtuous, who abide in heedfulness and are freed by perfect knowledge." },
        { "no": "58", "verse": "Upon a heap of rubbish in the road-side ditch blooms a lotus, fragrant and pleasing." },
        { "no": "59", "verse": "Even so, on the rubbish heap of blinded mortals the disciple of the Supremely Enlightened One shines resplendent in wisdom." }
      ]
    },
    {
      "title": "The Fool",
      "verses": [
        { "no": "60", "verse": "Long is the night to the sleepless; long is the league to the weary. Long is worldly existence to fools who know not the Sublime Truth." },
        { "no": "61", "verse": "Should a seeker not find a companion who is better or equal, let him resolutely pursue a solitary course; there is no fellowship with the fool." },
        { "no": "62", "verse": "The fool worries, thinking, “I have sons, I have wealth.” Indeed, when he himself is not his own, whence are sons, whence is wealth?" },
        { "no": "63", "verse": "A fool who knows his foolishness is wise at least to that extent, but a fool who thinks himself wise is a fool indeed." },
        { "no": "64", "verse": "Though all his life a fool associates with a wise man, he no more comprehends the Truth than a spoon tastes the flavor of the soup." },
        { "no": "65", "verse": "Though only for a moment a discerning person associates with a wise man, quickly he comprehends the Truth, just as the tongue tastes the flavor of the soup." },
        { "no": "66", "verse": "Fools of little wit are enemies unto themselves as they move about doing evil deeds, the fruits of which are bitter." },
        { "no": "67", "verse": "Ill done is that action of doing which one repents later, and the fruit of which one, weeping, reaps with tears." },
        { "no": "68", "verse": "Well done is that action of doing which one repents not later, and the fruit of which one reaps with delight and happiness." },
        { "no": "69", "verse": "So long as an evil deed has not ripened, the fool thinks it as sweet as honey. But when the evil deed ripens, the fool comes to grief." },
        { "no": "70", "verse": "Month after month a fool may eat his food with the tip of a blade of grass, but he still is not worth a sixteenth part of the those who have comprehended the Truth." },
        { "no": "71", "verse": "Truly, an evil deed committed does not immediately bear fruit, like milk that does not turn sour all at once. But smoldering, it follows the fool like fire covered by ashes." },
        { "no": "72", "verse": "To his own ruin the fool gains knowledge, for it cleaves his head and destroys his innate goodness." },
        { "no": "73", "verse": "The fool seeks undeserved reputation, precedence among monks, authority over monasteries, and honor among householders." },
        { "no": "74", "verse": "“Let both laymen and monks think that it was done by me. In every work, great and small, let them follow me” – such is the ambition of the fool; thus his desire and pride increase." },
        { "no": "75", "verse": "One is the quest for worldly gain, and quite another is the path to Nibbana. Clearly understanding this, let not the monk, the disciple of the Buddha, be carried away by worldly acclaim, but develop detachment instead." }
      ]
    },
    {
      "title": "The Wise Man",
      "verses": [
        { "no": "76", "verse": "Should one find a man who points out faults and who reproves, let him follow such a wise and sagacious person as one would a guide to hidden treasure. It is always better, and never worse, to cultivate such an association." },
        { "no": "77", "verse": "Let him admonish, instruct and shield one from wrong; he, indeed, is dear to the good and detestable to the evil." },
        { "no": "78", "verse": "Do not associate with evil companions; do not seek the fellowship of the vile. Associate with the good friends; seek the fellowship of noble men." },
        { "no": "79", "verse": "He who drinks deep the Dhamma lives happily with a tranquil mind. The wise man ever delights in the Dhamma made known by the Noble One (the Buddha)." },
        { "no": "80", "verse": "Irrigators regulate the rivers; fletchers straighten the arrow shaft; carpenters shape the wood; the wise control themselves." },
        { "no": "81", "verse": "Just as a solid rock is not shaken by the storm, even so the wise are not affected by praise or blame." },
        { "no": "82", "verse": "On hearing the Teachings, the wise become perfectly purified, like a lake deep, clear and still." },
        { "no": "83", "verse": "The good renounce (attachment for) everything. The virtuous do not prattle with a yearning for pleasures. The wise show no elation or depression when touched by happiness or sorrow." },
        { "no": "84", "verse": "He is indeed virtuous, wise, and righteous who neither for his own sake nor for the sake of another (does any wrong), who does not crave for sons, wealth, or kingdom, and does not desire success by unjust means." },
        { "no": "85", "verse": "Few among men are those who cross to the farther shore. The rest, the bulk of men, only run up and down the hither bank." },
        { "no": "86", "verse": "But those who act according to the perfectly taught Dhamma will cross the realm of Death, so difficult to cross." },
        { "no": "87-88", "verse": "Abandoning the dark way, let the wise man cultivate the bright path. Having gone from home to homelessness, let him yearn for that delight in detachment, so difficult to enjoy. Giving up sensual pleasures, with no attachment, let the wise man cleanse himself of defilements of the mind." },
        { "no": "89", "verse": "Those whose minds have reached full excellence in the factors of enlightenment, who, having renounced acquisitiveness, rejoice in not clinging to things – rid of cankers, glowing with wisdom, they have attained Nibbana in this very life.", "footnote": "This verse describes the Arahat, dealt with more fully in the following chapter. The “cankers” (asava) are the four basic defilements of sensual desire, desire for continued existence, false views and ignorance." }
      ]
    },
    {
      "title": "The Arahat: The Perfected One",
      "verses": [
        { "no": "90", "verse": "The fever of passion exists not for him who has completed the journey, who is sorrowless and wholly set free, and has broken all ties." },
        { "no": "91", "verse": "The mindful ones exert themselves. They are not attached to any home; like swans that abandon the lake, they leave home after home behind." },
        { "no": "92", "verse": "Those who do not accumulate and are wise regarding food, whose object is the Void, the Unconditioned Freedom – their track cannot be traced, like that of birds in the air." },
        { "no": "93", "verse": "He whose cankers are destroyed and who is not attached to food, whose object is the Void, the Unconditioned Freedom – his path cannot be traced, like that of birds in the air." },
        { "no": "94", "verse": "Even the gods hold dear the wise one, whose senses are subdued like horses well trained by a charioteer, whose pride is destroyed and who is free from the cankers." },
        { "no": "95", "verse": "There is no more worldly existence for the wise one who, like the earth, resents nothing, who is firm as a high pillar and as pure as a deep pool free from mud." },
        { "no": "96", "verse": "Calm is his thought, calm his speech, and calm his deed, who, truly knowing, is wholly freed, perfectly tranquil and wise." },
        { "no": "97", "verse": "The man who is without blind faith, who knows the Uncreated, who has severed all links, destroyed all causes (for karma, good and evil), and thrown out all desires – he, truly, is the most excellent of men.", "footnote": "In the Pali this verse presents a series of puns, and if the “underside” of each pun were to be translated, the verse would read thus: “The man who is faithless, ungrateful, a burglar, who destroys opportunities and eats vomit – he truly is the most excellent of men.”" },
        { "no": "98", "verse": "Inspiring, indeed, is that place where Arahants dwell, be it a village, a forest, a vale, or a hill." },
        { "no": "99", "verse": "Inspiring are the forests in which worldlings find no pleasure. There the passionless will rejoice, for they seek no sensual pleasures." }
      ]
    },
    {
      "title": "The Thousands",
      "verses": [
        { "no": "100", "verse": "Better than a thousand useless words is one useful word, hearing which one attains peace." },
        { "no": "101", "verse": "Better than a thousand useless verses is one useful verse, hearing which one attains peace." },
        { "no": "102", "verse": "Better than reciting a hundred meaningless verses is the reciting of one verse of Dhamma, hearing which one attains peace." },
        { "no": "103", "verse": "Though one may conquer a thousand times a thousand men in battle, yet he indeed is the noblest victor who conquers himself." },
        { "no": "104-105", "verse": "Self-conquest is far better than the conquest of others. Not even a god, an angel, Mara or Brahma can turn into defeat the victory of a person who is self-subdued and ever restrained in conduct.", "footnote": "Brahma: a high divinity in ancient Indian religion." },
        { "no": "106", "verse": "Though month after month for a hundred years one should offer sacrifices by the thousands, yet if only for a moment one should worship those of perfected minds that honor is indeed better than a century of sacrifice." },
        { "no": "107", "verse": "Though for a hundred years one should tend the sacrificial fire in the forest, yet if only for a moment one should worship those of perfected minds, that worship is indeed better than a century of sacrifice." },
        { "no": "108", "verse": "Whatever gifts and oblations one seeking merit might offer in this world for a whole year, all that is not worth one fourth of the merit gained by revering the Upright Ones, which is truly excellent." },
        { "no": "109", "verse": "To one ever eager to revere and serve the elders, these four blessing accrue: long life and beauty, happiness and power." },
        { "no": "110", "verse": "Better it is to live one day virtuous and meditative than to live a hundred years immoral and uncontrolled." },
        { "no": "111", "verse": "Better it is to live one day wise and meditative than to live a hundred years foolish and uncontrolled." },
        { "no": "112", "verse": "Better it is to live one day strenuous and resolute than to live a hundred years sluggish and dissipated." },
        { "no": "113", "verse": "Better it is to live one day seeing the rise and fall of things than to live a hundred years without ever seeing the rise and fall of things." },
        { "no": "114", "verse": "Better it is to live one day seeing the Deathless than to live a hundred years without ever seeing the Deathless." },
        { "no": "115", "verse": "Better it is to live one day seeing the Supreme Truth than to live a hundred years without ever seeing the Supreme Truth." }
      ]
    },
    {
      "title": "Evil",
      "verses": [
        { "no": "116", "verse": "Hasten to do good; restrain your mind from evil. He who is slow in doing good, his mind delights in evil." },
        { "no": "117", "verse": "Should a person commit evil, let him not do it again and again. Let him not find pleasure therein, for painful is the accumulation of evil." },
        { "no": "118", "verse": "Should a person do good, let him do it again and again. Let him find pleasure therein, for blissful is the accumulation of good." },
        { "no": "119", "verse": "It may be well with the evil-doer as long as the evil ripens not. But when it does ripen, then the evil-doer sees (the painful results of) his evil deeds." },
        { "no": "120", "verse": "It may be ill with the doer of good as long as the good ripens not. But when it does ripen, then the doer of good sees (the pleasant results of) his good deeds." },
        { "no": "121", "verse": "Think not lightly of evil, saying, “It will not come to me.” Drop by drop is the water pot filled. Likewise, the fool, gathering it little by little, fills himself with evil." },
        { "no": "122", "verse": "Think not lightly of good, saying, “It will not come to me.” Drop by drop is the water pot filled. Likewise, the wise man, gathering it little by little, fills himself with good." },
        { "no": "123", "verse": "Just as a trader with a small escort and great wealth would avoid a perilous route, or just as one desiring to live avoids poison, even so should one shun evil." },
        { "no": "124", "verse": "If on the hand there is no wound, one may carry even poison in it. Poison does not affect one who is free from wounds. For him who does no evil, there is no ill." },
        { "no": "125", "verse": "Like fine dust thrown against the wind, evil falls back upon that fool who offends an inoffensive, pure and guiltless man." },
        { "no": "126", "verse": "Some are born in the womb; the wicked are born in hell; the devout go to heaven; the stainless pass into Nibbana." },
        { "no": "127", "verse": "Neither in the sky nor in mid-ocean, nor by entering into mountain clefts, nowhere in the world is there a place where one may escape from the results of evil deeds." },
        { "no": "128", "verse": "Neither in the sky nor in mid-ocean, nor by entering into mountain clefts, nowhere in the world is there a place where one will not be overcome by death." }
      ]
    },
    {
      "title": "Violence",
      "verses": [
        { "no": "129", "verse": "All tremble at violence; all fear death. Putting oneself in the place of another, one should not kill nor cause another to kill." },
        { "no": "130", "verse": "All tremble at violence; life is dear to all. Putting oneself in the place of another, one should not kill nor cause another to kill." },
        { "no": "131", "verse": "One who, while himself seeking happiness, oppresses with violence other beings who also desire happiness, will not attain happiness hereafter." },
        { "no": "132", "verse": "One who, while himself seeking happiness, does not oppress with violence other beings who also desire happiness, will find happiness hereafter." },
        { "no": "133", "verse": "Speak not harshly to anyone, for those thus spoken to might retort. Indeed, angry speech hurts, and retaliation may overtake you." },
        { "no": "134", "verse": "If, like a broken gong, you silence yourself, you have approached Nibbana, for vindictiveness is no longer in you." },
        { "no": "135", "verse": "Just as a cowherd drives the cattle to pasture with a staff, so do old age and death drive the life force of beings (from existence to existence)." },
        { "no": "136", "verse": "When the fool commits evil deeds, he does not realize (their evil nature). The witless man is tormented by his own deeds, like one burnt by fire." },
        { "no": "137", "verse": "He who inflicts violence on those who are unarmed, and offends those who are inoffensive, will soon come upon one of these ten states:" },
        { "no": "138-140", "verse": "Sharp pain, or disaster, bodily injury, serious illness, or derangement of mind, trouble from the government, or grave charges, loss of relatives, or loss of wealth, or houses destroyed by ravaging fire; upon dissolution of the body that ignorant man is born in hell." },
        { "no": "141", "verse": "Neither going about naked, nor matted locks, nor filth, nor fasting, nor lying on the ground, nor smearing oneself with ashes and dust, nor sitting on the heels (in penance) can purify a mortal who has not overcome doubt." },
        { "no": "142", "verse": "Even though he be well-attired, yet if he is poised, calm, controlled and established in the holy life, having set aside violence towards all beings – he, truly, is a holy man, a renunciate, a monk." },
        { "no": "143", "verse": "Only rarely is there a man in this world who, restrained by modesty, avoids reproach, as a thoroughbred horse avoids the whip." },
        { "no": "144", "verse": "Like a thoroughbred horse touched by the whip, be strenuous, be filled with spiritual yearning. By faith and moral purity, by effort and meditation, by investigation of the truth, by being rich in knowledge and virtue, and by being mindful, destroy this unlimited suffering." },
        { "no": "145", "verse": "Irrigators regulate the waters, fletchers straighten arrow shafts, carpenters shape wood, and the good control themselves." }
      ]
    },
    {
      "title": "Old Age",
      "verses": [
        { "no": "146", "verse": "When this world is ever ablaze, why this laughter, why this jubilation? Shrouded in darkness, will you not see the light?" },
        { "no": "147", "verse": "Behold this body – a painted image, a mass of heaped up sores, infirm, full of hankering – of which nothing is lasting or stable!" },
        { "no": "148", "verse": "Fully worn out is this body, a nest of disease, and fragile. This foul mass breaks up, for death is the end of life." },
        { "no": "149", "verse": "These dove-colored bones are like gourds that lie scattered about in autumn. Having seen them, how can one seek delight?" },
        { "no": "150", "verse": "This city (body) is built of bones, plastered with flesh and blood; within are decay and death, pride and jealousy." },
        { "no": "151", "verse": "Even gorgeous royal chariots wear out, and indeed this body too wears out. But the Dhamma of the Good does not age; thus the Good make it known to the good." },
        { "no": "152", "verse": "The man of little learning grows old like a bull. He grows only in bulk, but, his wisdom does not grow." },
        { "no": "153", "verse": "Through many a birth in samsara have I wandered in vain, seeking the builder of this house (of life). Repeated birth is indeed suffering!" },
        { "no": "154", "verse": "O house-builder, you are seen! You will not build this house again. For your rafters are broken and your ridgepole shattered. My mind has reached the Unconditioned; I have attained the destruction of craving.", "footnote": "According to the commentary, these verses are the Buddha’s “Song of Victory,” his first utterance after his Enlightenment. The house is individualized existence in samsara, the house-builder craving, the rafters the passions and the ridge-pole ignorance." },
        { "no": "155", "verse": "Those who in youth have not led the holy life, or have failed to acquire wealth, languish like old cranes in the pond without fish." },
        { "no": "156", "verse": "Those who in youth have not lead the holy life, or have failed to acquire wealth, lie sighing over the past, like worn out arrows (shot from) a bow." }
      ]
    },
    {
      "title": "The Self",
      "verses": [
        { "no": "157", "verse": "If one holds oneself dear, one should diligently watch oneself. Let the wise man keep vigil during any of the three watches of the night." },
        { "no": "158", "verse": "One should first establish oneself in what is proper; then only should one instruct others. Thus the wise man will not be reproached." },
        { "no": "159", "verse": "One should do what one teaches others to do; if one would train others, one should be well controlled oneself. Difficult, indeed, is self-control." },
        { "no": "160", "verse": "One truly is the protector of oneself; who else could the protector be? With oneself fully controlled, one gains a mastery that is hard to gain." },
        { "no": "161", "verse": "The evil a witless man does by himself, born of himself and produced by himself, grinds him as a diamond grinds a hard gem." },
        { "no": "162", "verse": "Just as a single creeper strangles the tree on which it grows, even so, a man who is exceedingly depraved harms himself as only an enemy might wish." },
        { "no": "163", "verse": "Easy to do are things that are bad and harmful to oneself. But exceedingly difficult to do are things that are good and beneficial." },
        { "no": "164", "verse": "Whoever, on account of perverted views, scorns the Teaching of the Perfected Ones, the Noble and Righteous Ones – that fool, like the bamboo, produces fruits only for self destruction.", "footnote": "Certain reeds of the bamboo family perish immediately after producing fruits." },
        { "no": "165", "verse": "By oneself is evil done; by oneself is one defiled. By oneself is evil left undone; by oneself is one made pure. Purity and impurity depend on oneself; no one can purify another." },
        { "no": "166", "verse": "Let one not neglect one’s own welfare for the sake of another, however great. Clearly understanding one’s own welfare, let one be intent upon the good." }
      ]
    },
    {
      "title": "The World",
      "verses": [
        { "no": "167", "verse": "Follow not the vulgar way; live not in heedlessness; hold not false views; linger not long in worldly existence." },
        { "no": "168", "verse": "Arise! Do not be heedless! Lead a righteous life. The righteous live happily both in this world and the next." },
        { "no": "169", "verse": "Lead a righteous life; lead not a base life. The righteous live happily both in this world and the next." },
        { "no": "170", "verse": "One who looks upon the world as a bubble and a mirage, him the King of Death sees not." },
        { "no": "171", "verse": "Come! Behold this world, which is like a decorated royal chariot. Here fools flounder, but the wise have no attachment to it." },
        { "no": "172", "verse": "He who having been heedless is heedless no more, illuminates this world like the moon freed from clouds." },
        { "no": "173", "verse": "He, who by good deeds covers the evil he has done, illuminates this world like the moon freed from clouds." },
        { "no": "174", "verse": "Blind is the world; here only a few possess insight. Only a few, like birds escaping from the net, go to realms of bliss." },
        { "no": "175", "verse": "Swans fly on the path of the sun; men pass through the air by psychic powers; the wise are led away from the world after vanquishing Mara and his host." },
        { "no": "176", "verse": "For a liar who has violated the one law (of truthfulness) who holds in scorn the hereafter, there is no evil that he cannot do." },
        { "no": "177", "verse": "Truly, misers fare not to heavenly realms; nor, indeed, do fools praise generosity. But the wise man rejoices in giving, and by that alone does he become happy hereafter." },
        { "no": "178", "verse": "Better than sole sovereignty over the earth, better than going to heaven, better even than lordship over all the worlds is the supramundane Fruition of Stream Entrance.", "footnote": "Stream-entry (sotapatti): the first stage of supramundane attainment." }
      ]
    },
    {
      "title": "The Buddha",
      "verses": [
        { "no": "179", "verse": "By what track can you trace that trackless Buddha of limitless range, whose victory nothing can undo, whom none of the vanquished defilements can ever pursue?" },
        { "no": "180", "verse": "By what track can you trace that trackless Buddha of limitless range, in whom exists no longer, the entangling and embroiling craving that perpetuates becoming?" },
        { "no": "181", "verse": "Those wise ones who are devoted to meditation and who delight in the calm of renunciation – such mindful ones, Supreme Buddhas, even the gods hold dear." },
        { "no": "182", "verse": "Hard is it to be born a man; hard is the life of mortals. Hard is it to gain the opportunity of hearing the Sublime Truth, and hard to encounter is the arising of the Buddhas." },
        { "no": "183", "verse": "To avoid all evil, to cultivate good, and to cleanse one’s mind – this is the teaching of the Buddhas." },
        { "no": "184", "verse": "Enduring patience is the highest austerity. “Nibbana is supreme,” say the Buddhas. He is not a true monk who harms another, nor a true renunciate who oppresses others." },
        { "no": "185", "verse": "Not despising, not harming, restraint according to the code of monastic discipline, moderation in food, dwelling in solitude, devotion to meditation – this is the teaching of the Buddhas." },
        { "no": "186-187", "verse": "There is no satisfying sensual desires, even with the rain of gold coins. For sensual pleasures give little satisfaction and much pain. Having understood this, the wise man finds no delight even in heavenly pleasures. The disciple of the Supreme Buddha delights in the destruction of craving." },
        { "no": "188", "verse": "Driven only by fear, do men go for refuge to many places – to hills, woods, groves, trees and shrines." },
        { "no": "189", "verse": "Such, indeed, is no safe refuge; such is not the refuge supreme. Not by resorting to such a refuge is one released from all suffering." },
        { "no": "190-191", "verse": "He who has gone for refuge to the Buddha, the Teaching and his Order, penetrates with transcendental wisdom the Four Noble Truths – suffering, the cause of suffering, the cessation of suffering, and the Noble Eightfold Path leading to the cessation of suffering.", "footnote": "The Order: both the monastic Order (bhikkhu sangha) and the Order of Noble Ones (ariya sangha) who have reached the four supramundane stages." },
        { "no": "192", "verse": "This indeed is the safe refuge, this the refuge supreme. Having gone to such a refuge, one is released from all suffering." },
        { "no": "193", "verse": "Hard to find is the thoroughbred man (the Buddha); he is not born everywhere. Where such a wise man is born, that clan thrives happily." },
        { "no": "194", "verse": "Blessed is the birth of the Buddhas; blessed is the enunciation of the sacred Teaching; blessed is the harmony in the Order, and blessed is the spiritual pursuit of the united truth-seeker." },
        { "no": "195-196", "verse": "He who reveres those worthy of reverence, the Buddhas and their disciples, who have transcended all obstacles and passed beyond the reach of sorrow and lamentation – he who reveres such peaceful and fearless ones, his merit none can compute by any measure." }
      ]
    },
    {
      "title": "Happiness",
      "verses": [
        { "no": "197", "verse": "Happy indeed we live, friendly amidst the hostile. Amidst hostile men we dwell free from hatred." },
        { "no": "198", "verse": "Happy indeed we live, friendly amidst the afflicted (by craving). Amidst afflicted men we dwell free from affliction." },
        { "no": "199", "verse": "Happy indeed we live, free from avarice amidst the avaricious. Amidst the avaricious men we dwell free from avarice." },
        { "no": "200", "verse": "Happy indeed we live, we who possess nothing. Feeders on joy we shall be, like the Radiant Gods." },
        { "no": "201", "verse": "Victory begets enmity; the defeated dwell in pain. Happily the peaceful live, discarding both victory and defeat." },
        { "no": "202", "verse": "There is no fire like lust and no crime like hatred. There is no ill like the aggregates (of existence) and no bliss higher than the peace (of Nibbana).", "footnote": "Aggregates (of existence) (khandha): the five groups of factors into which the Buddha analyzes the living being – material form, feeling, perception, mental formations, and consciousness." },
        { "no": "203", "verse": "Hunger is the worst disease, conditioned things the worst suffering. Knowing this as it really is, the wise realize Nibbana, the highest bliss." },
        { "no": "204", "verse": "Health is the most precious gain and contentment the greatest wealth. A trustworthy person is the best kinsman, Nibbana the highest bliss." },
        { "no": "205", "verse": "Having savored the taste of solitude and peace (of Nibbana), pain-free and stainless he becomes, drinking deep the taste of the bliss of the Truth." },
        { "no": "206", "verse": "Good is it to see the Noble Ones; to live with them is ever blissful. One will always be happy by not encountering fools." },
        { "no": "207", "verse": "Indeed, he who moves in the company of fools grieves for longing. Association with fools is ever painful, like partnership with an enemy. But association with the wise is happy, like meeting one’s own kinsmen." },
        { "no": "208", "verse": "Therefore, follow the Noble One, who is steadfast, wise, learned, dutiful and devout. One should follow only such a man, who is truly good and discerning, even as the moon follows the path of the stars." }
      ]
    },
    {
      "title": "Affection",
      "verses": [
        { "no": "209", "verse": "Giving himself to things to be shunned and not exerting where exertion is needed, a seeker after pleasures, having given up his true welfare, envies those intent upon theirs." },
        { "no": "210", "verse": "Seek no intimacy with the beloved and also not with the unloved, for not to see the beloved and to see the unloved, both are painful." },
        { "no": "211", "verse": "Therefore hold nothing dear, for separation from the dear is painful. There are no bonds for those who have nothing beloved or unloved." },
        { "no": "212", "verse": "From endearment springs grief, from endearment springs fear. For one who is wholly free from endearment there is no grief, whence then fear?" },
        { "no": "213", "verse": "From affection springs grief, from affection springs fear. For one who is wholly free from affection there is no grief, whence then fear?" },
        { "no": "214", "verse": "From attachment springs grief, from attachment springs fear. For one who is wholly free from attachment there is no grief, whence then fear?" },
        { "no": "215", "verse": "From lust springs grief, from lust springs fear. For one who is wholly free from craving there is no grief; whence then fear?" },
        { "no": "216", "verse": "From craving springs grief, from craving springs fear. For one who is wholly free from craving there is no grief; whence then fear?" },
        { "no": "217", "verse": "People hold dear him who embodies virtue and insight, who is principled, has realized the truth, and who himself does what he ought to be doing." },
        { "no": "218", "verse": "One who is intent upon the Ineffable (Nibbana), dwells with mind inspired (by supramundane wisdom), and is no more bound by sense pleasures – such a man is called “One Bound Upstream.”", "footnote": "One Bound Upstream: a Non-returner (anagami)." },
        { "no": "219", "verse": "When, after a long absence, a man safely returns from afar, his relatives, friends and well-wishers welcome him home on arrival." },
        { "no": "220", "verse": "As kinsmen welcome a dear one on arrival, even so his own good deeds will welcome the doer of good who has gone from this world to the next." }
      ]
    },
    {
      "title": "Anger",
      "verses": [
        { "no": "221", "verse": "One should give up anger, renounce pride, and overcome all fetters. Suffering never befalls him who clings not to mind and body and is detached." },
        { "no": "222", "verse": "He who checks rising anger as a charioteer checks a rolling chariot, him I call a true charioteer. Others only hold the reins." },
        { "no": "223", "verse": "Overcome the angry by non-anger; overcome the wicked by goodness; overcome the miser by generosity; overcome the liar by truth." },
        { "no": "224", "verse": "Speak the truth; yield not to anger; when asked, give even if you only have a little. By these three means can one reach the presence of the gods." },
        { "no": "225", "verse": "Those sages who are inoffensive and ever restrained in body, go to the Deathless State, where, having gone, they grieve no more." },
        { "no": "226", "verse": "Those who are ever vigilant, who discipline themselves day and night, and are ever intent upon Nibbana – their defilements fade away." },
        { "no": "227", "verse": "O Atula! Indeed, this is an ancient practice, not one only of today: they blame those who remain silent, they blame those who speak much, they blame those who speak in moderation. There is none in the world who is not blamed." },
        { "no": "228", "verse": "There never was, there never will be, nor is there now, a person who is wholly blamed or wholly praised." },
        { "no": "229", "verse": "But the man whom the wise praise, after observing him day after day, is one of flawless character, wise, and endowed with knowledge and virtue." },
        { "no": "230", "verse": "Who can blame such a one, as worthy as a coin of refined gold? Even the gods praise him; by Brahma, too, is he praised." },
        { "no": "231", "verse": "Let a man guard himself against irritability in bodily action; let him be controlled in deed. Abandoning bodily misconduct, let him practice good conduct in deed." },
        { "no": "232", "verse": "Let a man guard himself against irritability in speech; let him be controlled in speech. Abandoning verbal misconduct, let him practice good conduct in speech." },
        { "no": "233", "verse": "Let a man guard himself against irritability in thought; let him be controlled in mind. Abandoning mental misconduct, let him practice good conduct in thought." },
        { "no": "234", "verse": "The wise are controlled in bodily action, controlled in speech and controlled in thought. They are truly well-controlled." }
      ]
    },
    {
      "title": "Impurity",
      "verses": [
        { "no": "235", "verse": "Like a withered leaf are you now; death’s messengers await you. You stand on the eve of your departure, yet you have made no provision for your journey!" },
        { "no": "236", "verse": "Make an island for yourself! Strive hard and become wise! Rid of impurities and cleansed of stain, you shall enter the celestial abode of the Noble Ones." },
        { "no": "237", "verse": "Your life has come to an end now; You are setting forth into the presence of Yama, the king of death. No resting place is there for you on the way, yet you have made no provision for the journey!" },
        { "no": "238", "verse": "Make an island unto yourself! Strive hard and become wise! Rid of impurities and cleansed of stain, you shall not come again to birth and decay." },
        { "no": "239", "verse": "One by one, little by little, moment by moment, a wise man should remove his own impurities, as a smith removes his dross from silver." },
        { "no": "240", "verse": "Just as rust arising from iron eats away the base from which it arises, even so, their own deeds lead transgressors to states of woe." },
        { "no": "241", "verse": "Non-repetition is the bane of scriptures; neglect is the bane of a home; slovenliness is the bane of personal appearance, and heedlessness is the bane of a guard." },
        { "no": "242", "verse": "Unchastity is the taint in a woman; niggardliness is the taint in a giver. Taints, indeed, are all evil things, both in this world and the next." },
        { "no": "243", "verse": "A worse taint than these is ignorance, the worst of all taints. Destroy this one taint and become taintless, O monks!" },
        { "no": "244", "verse": "Easy is life for the shameless one who is impudent as a crow, is backbiting and forward, arrogant and corrupt." },
        { "no": "245", "verse": "Difficult is life for the modest one who always seeks purity, is detached and unassuming, clean in life, and discerning." },
        { "no": "246-247", "verse": "One who destroys life, utters lies, takes what is not given, goes to another man’s wife, and is addicted to intoxicating drinks – such a man digs up his own root even in this world." },
        { "no": "248", "verse": "Know this, O good man: evil things are difficult to control. Let not greed and wickedness drag you to protracted misery." },
        { "no": "249", "verse": "People give according to their faith or regard. If one becomes discontented with the food and drink given by others, one does not attain meditative absorption, either by day or by night." },
        { "no": "250", "verse": "But he in who this (discontent) is fully destroyed, uprooted and extinct, he attains absorption, both by day and by night." },
        { "no": "251", "verse": "There is no fire like lust; there is no grip like hatred; there is no net like delusion; there is no river like craving." },
        { "no": "252", "verse": "Easily seen is the fault of others, but one’s own fault is difficult to see. Like chaff one winnows another’s faults, but hides one’s own, even as a crafty fowler hides behind sham branches." },
        { "no": "253", "verse": "He who seeks another’s faults, who is ever censorious – his cankers grow. He is far from destruction of the cankers." },
        { "no": "254", "verse": "There is no track in the sky, and no recluse outside (the Buddha’s dispensation). Mankind delights in worldliness, but the Buddhas are free from worldliness.", "footnote": "Recluse (samana): here used in the special sense of those who have reached the four supramundane stages." },
        { "no": "255", "verse": "There is no track in the sky, and no recluse outside (the Buddha’s dispensation). There are no conditioned things that are eternal, and no instability in the Buddhas." }
      ]
    },
    {
      "title": "The Just",
      "verses": [
        { "no": "256", "verse": "Not by passing arbitrary judgments does a man become just; a wise man is he who investigates both right and wrong." },
        { "no": "257", "verse": "He who does not judge others arbitrarily, but passes judgment impartially according to the truth, that sagacious man is a guardian of law and is called just." },
        { "no": "258", "verse": "One is not wise because one speaks much. He who is peaceable, friendly and fearless is called wise." },
        { "no": "259", "verse": "A man is not versed in Dhamma because he speaks much. He who, after hearing a little Dhamma, realizes its truth directly and is not heedless of it, is truly versed in the Dhamma." },
        { "no": "260", "verse": "A monk is not an elder because his head is gray. He is but ripe in age, and he is called one grown old in vain." },
        { "no": "261", "verse": "One in whom there is truthfulness, virtue, inoffensiveness, restraint and self-mastery, who is free from defilements and is wise – he is truly called an Elder." },
        { "no": "262", "verse": "Not by mere eloquence nor by beauty of form does a man become accomplished, if he is jealous, selfish and deceitful." },
        { "no": "263", "verse": "But he in whom these are wholly destroyed, uprooted and extinct, and who has cast out hatred – that wise man is truly accomplished." },
        { "no": "264", "verse": "Not by shaven head does a man who is indisciplined and untruthful become a monk. How can he who is full of desire and greed be a monk?" },
        { "no": "265", "verse": "He who wholly subdues evil both small and great is called a monk, because he has overcome all evil." },
        { "no": "266", "verse": "He is not a monk just because he lives on others’ alms. Not by adopting outward form does one become a true monk." },
        { "no": "267", "verse": "Whoever here (in the Dispensation) lives a holy life, transcending both merit and demerit, and walks with understanding in this world – he is truly called a monk." },
        { "no": "268", "verse": "Not by observing silence does one become a sage, if he be foolish and ignorant. But that man is wise who, as if holding a balance-scale accepts only the good." },
        { "no": "269", "verse": "The sage (thus) rejecting the evil, is truly a sage. Since he comprehends both (present and future) worlds, he is called a sage." },
        { "no": "270", "verse": "He is not noble who injures living beings. He is called noble because he is harmless towards all living beings." },
        { "no": "271-272", "verse": "Not by rules and observances, not even by much learning, nor by gain of absorption, nor by a life of seclusion, nor by thinking, “I enjoy the bliss of renunciation, which is not experienced by the worldling” should you, O monks, rest content, until the utter destruction of cankers (Arahantship) is reached." }
      ]
    },
    {
      "title": "The Path",
      "verses": [
        { "no": "273", "verse": "Of all the paths the Eightfold Path is the best; of all the truths the Four Noble Truths are the best; of all things passionlessness is the best: of men the Seeing One (the Buddha) is the best." },
        { "no": "274", "verse": "This is the only path; there is none other for the purification of insight. Tread this path, and you will bewilder Mara." },
        { "no": "275", "verse": "Walking upon this path you will make an end of suffering. Having discovered how to pull out the thorn of lust, I make known the path." },
        { "no": "276", "verse": "You yourselves must strive; the Buddhas only point the way. Those meditative ones who tread the path are released from the bonds of Mara." },
        { "no": "277", "verse": "“All conditioned things are impermanent” – when one sees this with wisdom, one turns away from suffering. This is the path to purification." },
        { "no": "278", "verse": "“All conditioned things are unsatisfactory” – when one sees this with wisdom, one turns away from suffering. This is the path to purification." },
        { "no": "279", "verse": "“All things are not-self” – when one sees this with wisdom, one turns away from suffering. This is the path to purification." },
        { "no": "280", "verse": "The idler who does not exert himself when he should, who though young and strong is full of sloth, with a mind full of vain thoughts – such an indolent man does not find the path to wisdom." },
        { "no": "281", "verse": "Let a man be watchful of speech, well controlled in mind, and not commit evil in bodily action. Let him purify these three courses of action, and win the path made known by the Great Sage." },
        { "no": "282", "verse": "Wisdom springs from meditation; without meditation wisdom wanes. Having known these two paths of progress and decline, let a man so conduct himself that his wisdom may increase." },
        { "no": "283", "verse": "Cut down the forest (lust), but not the tree; from the forest springs fear. Having cut down the forest and the underbrush (desire), be passionless, O monks!", "footnote": "The meaning of this injunction is: “Cut down the forest of lust, but do not mortify the body.”" },
        { "no": "284", "verse": "For so long as the underbrush of desire, even the most subtle, of a man towards a woman is not cut down, his mind is in bondage, like the sucking calf to its mother." },
        { "no": "285", "verse": "Cut off your affection in the manner of a man who plucks with his hand an autumn lotus. Cultivate only the path to peace, Nibbana, as made known by the Exalted One." },
        { "no": "286", "verse": "“Here shall I live during the rains, here in winter and summer” – thus thinks the fool. He does not realize the danger (that death might intervene)." },
        { "no": "287", "verse": "As a great flood carries away a sleeping village, so death seizes and carries away the man with a clinging mind, doting on his children and cattle." },
        { "no": "288", "verse": "For him who is assailed by death there is no protection by kinsmen. None there are to save him – no sons, nor father, nor relatives." },
        { "no": "289", "verse": "Realizing this fact, let the wise man, restrained by morality, hasten to clear the path leading to Nibbana." }
      ]
    },
    {
      "title": "Miscellaneous",
      "verses": [
        { "no": "290", "verse": "If by renouncing a lesser happiness one may realize a greater happiness, let the wise man renounce the lesser, having regard for the greater." },
        { "no": "291", "verse": "Entangled by the bonds of hate, he who seeks his own happiness by inflicting pain on others, is never delivered from hatred." },
        { "no": "292", "verse": "The cankers only increase for those who are arrogant and heedless, who leave undone what should be done and do what should not be done." },
        { "no": "293", "verse": "The cankers cease for those mindful and clearly comprehending ones who always earnestly practice mindfulness of the body, who do not resort to what should not be done, and steadfastly pursue what should be done." },
        { "no": "294", "verse": "Having slain mother (craving), father (self-conceit), two warrior-kings (eternalism and nihilism), and destroyed a country (sense organs and sense objects) together with its treasurer (attachment and lust), ungrieving goes the holy man." },
        { "no": "295", "verse": "Having slain mother, father, two brahman kings (two extreme views), and a tiger as the fifth (the five mental hindrances), ungrieving goes the holy man." },
        { "no": "296", "verse": "Those disciples of Gotama ever awaken happily who day and night constantly practice the Recollection of the Qualities of the Buddha." },
        { "no": "297", "verse": "Those disciples of Gotama ever awaken happily who day and night constantly practice the Recollection of the Qualities of the Dhamma." },
        { "no": "298", "verse": "Those disciples of Gotama ever awaken happily who day and night constantly practice the Recollection of the Qualities of the Sangha." },
        { "no": "299", "verse": "Those disciples of Gotama ever awaken happily who day and night constantly practice Mindfulness of the Body." },
        { "no": "300", "verse": "Those disciples of Gotama ever awaken happily whose minds by day and night delight in the practice of non-violence." },
        { "no": "301", "verse": "Those disciples of Gotama ever awaken happily whose minds by day and night delight in the practice of meditation." },
        { "no": "302", "verse": "Difficult is life as a monk; difficult is it to delight therein. Also difficult and sorrowful is the household life. Suffering comes from association with unequals; suffering comes from wandering in samsara. Therefore, be not an aimless wanderer, be not a pursuer of suffering." },
        { "no": "303", "verse": "He who is full of faith and virtue, and possesses good repute and wealth – he is respected everywhere, in whatever land he travels." },
        { "no": "304", "verse": "The good shine from afar, like the Himalaya mountains. But the wicked are unseen, like arrows shot in the night." },
        { "no": "305", "verse": "He who sits alone, sleeps alone, and walks alone, who is strenuous and subdues himself alone, will find delight in the solitude of the forest." }
      ]
    },
    {
      "title": "The State of Woe",
      "verses": [
        { "no": "306", "verse": "The liar goes to the state of woe; also he who, having done (wrong), says, “I did not do it.” Men of base actions both, on departing they share the same destiny in the other world." },
        { "no": "307", "verse": "There are many evil characters and uncontrolled men wearing the saffron robe. These wicked men will be born in states of woe because of their evil deeds." },
        { "no": "308", "verse": "It would be better to swallow a red-hot iron ball, blazing like fire, than as an immoral and uncontrolled monk to eat the alms of the people." },
        { "no": "309", "verse": "Four misfortunes befall the reckless man who consorts with another’s wife: acquisition of demerit, disturbed sleep, ill-repute, and (rebirth in) states of woe." },
        { "no": "310", "verse": "Such a man acquires demerit and an unhappy birth in the future. Brief is the pleasure of the frightened man and woman, and the king imposes heavy punishment. Hence, let no man consort with another’s wife." },
        { "no": "311", "verse": "Just as kusa grass wrongly handled cuts the hand, even so, a recluse’s life wrongly lived drags one to states of woe." },
        { "no": "312", "verse": "Any loose act, any corrupt observance, any life of questionable celibacy – none of these bear much fruit." },
        { "no": "313", "verse": "If anything is to be done, let one do it with sustained vigor. A lax monastic life stirs up the dust of passions all the more." },
        { "no": "314", "verse": "An evil deed is better left undone, for such a deed torments one afterwards. But a good deed is better done, doing which one repents not later." },
        { "no": "315", "verse": "Just as a border city is closely guarded both within and without, even so, guard yourself. Do not let slip this opportunity (for spiritual growth). For those who let slip this opportunity grieve indeed when consigned to hell." },
        { "no": "316", "verse": "Those who are ashamed of what they should not be ashamed of, and are not ashamed of what they should be ashamed of – upholding false views, they go to states of woe." },
        { "no": "317", "verse": "Those who see something to fear where there is nothing to fear, and see nothing to fear where there is something to fear – upholding false views, they go to states of woe." },
        { "no": "318", "verse": "Those who imagine evil where there is none, and do not see evil where it is – upholding false views, they go to states of woe." },
        { "no": "319", "verse": "Those who discern the wrong as wrong and the right as right – upholding right views, they go to realms of bliss." }
      ]
    },
    {
      "title": "The Elephant",
      "verses": [
        { "no": "320", "verse": "As an elephant in the battlefield withstands arrows shot from bows all around, even so shall I endure abuse. There are many, indeed, who lack virtue." },
        { "no": "321", "verse": "A tamed elephant is led into a crowd, and the king mounts a tamed elephant. Best among men is the subdued one who endures abuse." },
        { "no": "322", "verse": "Excellent are well-trained mules, thoroughbred Sindhu horses and noble tusker elephants. But better still is the man who has subdued himself." },
        { "no": "323", "verse": "Not by these mounts, however, would one go to the Untrodden Land (Nibbana), as one who is self-tamed goes by his own tamed and well-controlled mind." },
        { "no": "324", "verse": "Musty during rut, the tusker named Dhanapalaka is uncontrollable. Held in captivity, the tusker does not touch a morsel, but only longingly calls to mind the elephant forest." },
        { "no": "325", "verse": "When a man is sluggish and gluttonous, sleeping and rolling around in bed like a fat domestic pig, that sluggard undergoes rebirth again and again." },
        { "no": "326", "verse": "Formerly this mind wandered about as it liked, where it wished and according to its pleasure, but now I shall thoroughly master it with wisdom as a mahout controls with his ankus an elephant in rut." },
        { "no": "327", "verse": "Delight in heedfulness! Guard well your thoughts! Draw yourself out of this bog of evil, even as an elephant draws himself out of the mud." },
        { "no": "328", "verse": "If for company you find a wise and prudent friend who leads a good life, you should, overcoming all impediments, keep his company joyously and mindfully." },
        { "no": "329", "verse": "If for company you cannot find a wise and prudent friend who leads a good life, then, like a king who leaves behind a conquered kingdom, or like a lone elephant in the elephant forest, you should go your way alone." },
        { "no": "330", "verse": "Better it is to live alone; there is no fellowship with a fool. Live alone and do no evil; be carefree like an elephant in the elephant forest." },
        { "no": "331", "verse": "Good are friends when need arises; good is contentment with just what one has; good is merit when life is at an end, and good is the abandoning of all suffering (through Arahantship)." },
        { "no": "332", "verse": "In this world, good it is to serve one’s mother, good it is to serve one’s father, good it is to serve the monks, and good it is to serve the holy men." },
        { "no": "333", "verse": "Good is virtue until life’s end, good is faith that is steadfast, good is the acquisition of wisdom, and good is the avoidance of evil." }
      ]
    },
    {
      "title": "Craving",
      "verses": [
        { "no": "334", "verse": "The craving of one given to heedless living grows like a creeper. Like the monkey seeking fruits in the forest, he leaps from life to life (tasting the fruit of his kamma)." },
        { "no": "335", "verse": "Whoever is overcome by this wretched and sticky craving, his sorrows grow like grass after the rains." },
        { "no": "336", "verse": "But whoever overcomes this wretched craving, so difficult to overcome, from him sorrows fall away like water from a lotus leaf." },
        { "no": "337", "verse": "This I say to you: Good luck to all assembled here! Dig up the root of craving, like one in search of the fragrant root of the birana grass. Let not Mara crush you again and again, as a flood crushes a reed." },
        { "no": "338", "verse": "Just as a tree, though cut down, sprouts up again if its roots remain uncut and firm, even so, until the craving that lies dormant is rooted out, suffering springs up again and again." },
        { "no": "339", "verse": "The misguided man in whom the thirty-six currents of craving strongly rush toward pleasurable objects, is swept away by the flood of his passionate thoughts.", "footnote": "The thirty-six currents of craving: the three cravings – for sensual pleasure, for continued existence, and for annihilation – in relation to each of the twelve bases – the six sense organs, including mind, and their corresponding objects." },
        { "no": "340", "verse": "Everywhere these currents flow, and the creeper (of craving) sprouts and grows. Seeing that the creeper has sprung up, cut off its root with wisdom." },
        { "no": "341", "verse": "Flowing in (from all objects) and watered by craving, feelings of pleasure arise in beings. Bent on pleasures and seeking enjoyment, these men fall prey to birth and decay." },
        { "no": "342", "verse": "Beset by craving, people run about like an entrapped hare. Held fast by mental fetters, they come to suffering again and again for a long time." },
        { "no": "343", "verse": "Beset by craving, people run about like an entrapped hare. Therefore, one who yearns to be passion-free should destroy his own craving." },
        { "no": "344", "verse": "There is one who, turning away from desire (for household life) takes to the life of the forest (i.e., of a monk). But after being freed from the household, he runs back to it. Behold that man! Though freed, he runs back to that very bondage!", "footnote": "This verse, in the original, puns with the Pali word vana meaning both “desire” and “forest”." },
        { "no": "345-346", "verse": "That is not a strong fetter, the wise say, which is made of iron, wood or hemp. But the infatuation and longing for jewels and ornaments, children and wives – that, they say, is a far stronger fetter, which pulls one downward and, though seemingly loose, is hard to remove. This, too, the wise cut off. Giving up sensual pleasure, and without any longing, they renounce the world." },
        { "no": "347", "verse": "Those who are lust-infatuated fall back into the swirling current (of samsara) like a spider on its self-spun web. This, too, the wise cut off. Without any longing, they abandon all suffering and renounce the world." },
        { "no": "348", "verse": "Let go of the past, let go of the future, let go of the present, and cross over to the farther shore of existence. With mind wholly liberated, you shall come no more to birth and death." },
        { "no": "349", "verse": "For a person tormented by evil thoughts, who is passion-dominated and given to the pursuit of pleasure, his craving steadily grows. He makes the fetter strong, indeed." },
        { "no": "350", "verse": "He who delights in subduing evil thoughts, who meditates on the impurities and is ever mindful – it is he who will make an end of craving and rend asunder Mara’s fetter." },
        { "no": "351", "verse": "He who has reached the goal, is fearless, free from craving, passionless, and has plucked out the thorns of existence – for him this is the last body." },
        { "no": "352", "verse": "He who is free from craving and attachment, is perfect in uncovering the true meaning of the Teaching, and knows the arrangement of the sacred texts in correct sequence – he, indeed, is the bearer of his final body. He is truly called the profoundly wise one, the great man." },
        { "no": "353", "verse": "A victor am I over all, all have I known. Yet unattached am I to all that is conquered and known. Abandoning all, I am freed through the destruction of craving. Having thus directly comprehended all by myself, whom shall I call my teacher?", "footnote": "This was the Buddha’s reply to a wandering ascetic who asked him about his teacher. The Buddha’s answer shows that Supreme Enlightenment was his own unique attainment, which he had not learned from anyone else." },
        { "no": "354", "verse": "The gift of Dhamma excels all gifts; the taste of the Dhamma excels all tastes; the delight in Dhamma excels all delights. The Craving-Freed vanquishes all suffering." },
        { "no": "355", "verse": "Riches ruin only the foolish, not those in quest of the Beyond. By craving for riches the witless man ruins himself as well as others." },
        { "no": "356", "verse": "Weeds are the bane of fields, lust is the bane of mankind. Therefore, what is offered to those free of lust yields abundant fruit." },
        { "no": "357", "verse": "Weeds are the bane of fields, hatred is the bane of mankind. Therefore, what is offered to those free of hatred yields abundant fruit." },
        { "no": "358", "verse": "Weeds are the bane of fields, delusion is the bane of mankind. Therefore, what is offered to those free of delusion yields abundant fruit." },
        { "no": "359", "verse": "Weeds are the bane of fields, desire is the bane of mankind. Therefore, what is offered to those free of desire yields abundant fruit." }
      ]
    },
    {
      "title": "The Monk",
      "verses": [
        { "no": "360", "verse": "Good is restraint over the eye; good is restraint over the ear; good is restraint over the nose; good is restraint over the tongue." },
        { "no": "361", "verse": "Good is restraint in the body; good is restraint in speech; good is restraint in thought. Restraint everywhere is good. The monk restrained in every way is freed from all suffering." },
        { "no": "362", "verse": "He who has control over his hands, feet and tongue; who is fully controlled, delights in inward development, is absorbed in meditation, keeps to himself and is contented – him do people call a monk." },
        { "no": "363", "verse": "That monk who has control over his tongue, is moderate in speech, unassuming and who explains the Teaching in both letter and spirit – whatever he says is pleasing." },
        { "no": "364", "verse": "The monk who abides in the Dhamma, delights in the Dhamma, meditates on the Dhamma, and bears the Dhamma well in mind – he does not fall away from the sublime Dhamma." },
        { "no": "365", "verse": "One should not despise what one has received, nor envy the gains of others. The monk who envies the gains of others does not attain to meditative absorption." },
        { "no": "366", "verse": "A monk who does not despise what he has received, even though it be little, who is pure in livelihood and unremitting in effort – him even the gods praise." },
        { "no": "367", "verse": "He who has no attachment whatsoever for the mind and body, who does not grieve for what he has not – he is truly called a monk." },
        { "no": "368", "verse": "The monk who abides in universal love and is deeply devoted to the Teaching of the Buddha attains the peace of Nibbana, the bliss of the cessation of all conditioned things." },
        { "no": "369", "verse": "Empty this boat, O monk! Emptied, it will sail lightly. Rid of lust and hatred, you shall reach Nibbana." },
        { "no": "370", "verse": "Cut off the five, abandon the five, and cultivate the five. The monk who has overcome the five bonds is called one who has crossed the flood.", "footnote": "The five to be cut off are the five “lower fetters”: self-illusion, doubt, belief in rites and rituals, lust and ill-will. The five to be abandoned are the five “higher fetters”: craving for the divine realms with form, craving for the formless realms, conceit, restlessness, and ignorance. Stream-enterers and Once-returners cut off the first three fetters, Non-returners the next two and Arahats the last five. The five to be cultivated are the five spiritual faculties: faith, energy, mindfulness, concentration, and wisdom. The five bonds are: greed, hatred, delusion, false views, and conceit." },
        { "no": "371", "verse": "Meditate, O monk! Do not be heedless. Let not your mind whirl on sensual pleasures. Heedless, do not swallow a red-hot iron ball, lest you cry when burning, “O this is painful!”" },
        { "no": "372", "verse": "There is no meditative concentration for him who lacks insight, and no insight for him who lacks meditative concentration. He in whom are found both meditative concentration and insight, indeed, is close to Nibbana." },
        { "no": "373", "verse": "The monk who has retired to a solitary abode and calmed his mind, who comprehends the Dhamma with insight, in him there arises a delight that transcends all human delights." },
        { "no": "374", "verse": "Whenever he sees with insight the rise and fall of the aggregates, he is full of joy and happiness. To the discerning one this reflects the Deathless.", "footnote": "See footnote to v. 202." },
        { "no": "375", "verse": "Control of the senses, contentment, restraint according to the code of monastic discipline – these form the basis of holy life here for the wise monk." },
        { "no": "376", "verse": "Let him associate with friends who are noble, energetic, and pure in life, let him be cordial and refined in conduct. Thus, full of joy, he will make an end of suffering." },
        { "no": "377", "verse": "Just as the jasmine creeper sheds its withered flowers, even so, O monks, should you totally shed lust and hatred!" },
        { "no": "378", "verse": "The monk who is calm in body, calm in speech, calm in thought, well-composed and who has spewn out worldliness – he, truly, is called serene." },
        { "no": "379", "verse": "By oneself one must censure oneself and scrutinize oneself. The self-guarded and mindful monk will always live in happiness." },
        { "no": "380", "verse": "One is one’s own protector, one is one’s own refuge. Therefore, one should control oneself, even as a trader controls a noble steed." },
        { "no": "381", "verse": "Full of joy, full of faith in the Teaching of the Buddha, the monk attains the Peaceful State, the bliss of cessation of conditioned things." },
        { "no": "382", "verse": "That monk who while young devotes himself to the Teaching of the Buddha illumines this world like the moon freed from clouds." }
      ]
    },
    {
      "title": "The Holy Man",
      "verses": [
        { "no": "383", "verse": "Exert yourself, O holy man! Cut off the stream (of craving), and discard sense desires. Knowing the destruction of all the conditioned things, become, O holy man, the knower of the Uncreated (Nibbana)!", "footnote": "“Holy man” is used as a makeshift rendering for brahmana, intended to reproduce the ambiguity of the Indian word. Originally men of spiritual stature; by the time of the Buddha the brahmins had turned into a privileged priesthood which defined itself by means of birth and lineage rather than by genuine inner sanctity. The Buddha attempted to restore to the word brahmana its original connotation by identifying the true “holy man” as the Arahat, who merits the title through his own inward purity and holiness regardless of family lineage. The contrast between the two meanings is highlighted in verses 393 and 396. Those who led a contemplative life dedicated to gaining Arahatship could also be called brahmins, as in verses 383, 389, & 390." },
        { "no": "384", "verse": "When a holy man has reached the summit of two paths (meditative concentration and insight), he knows the truth and all his fetters fall away." },
        { "no": "385", "verse": "He for whom there is neither this shore nor the other shore, nor yet both, he who is free of cares and is unfettered – him do I call a holy man.", "footnote": "This shore: the six sense organs; the other shore: their corresponding objects; both: I-ness and my-ness." },
        { "no": "386", "verse": "He who is meditative, stainless and settled, whose work is done and who is free from cankers, having reached the highest goal – him do I call a holy man." },
        { "no": "387", "verse": "The sun shines by day, the moon shines by night. The warrior shines in armor, the holy man shines in meditation. But the Buddha shines resplendent all day and all night." },
        { "no": "388", "verse": "Because he has discarded evil, he is called a holy man. Because he is serene in conduct, he is called a recluse. And because he has renounced his impurities, he is called a renunciate." },
        { "no": "389", "verse": "One should not strike a holy man, nor should a holy man, when struck, give way to anger. Shame on him who strikes a holy man, and more shame on him who gives way to anger." },
        { "no": "390", "verse": "Nothing is better for a holy man than when he holds his mind back from what is endearing. To the extent the intent to harm wears away, to that extent does suffering subside." },
        { "no": "391", "verse": "He who does no evil in deed, word and thought, who is restrained in these three ways – him do I call a holy man." },
        { "no": "392", "verse": "Just as a brahman priest reveres his sacrificial fire, even so should one devoutly revere the person from whom one has learned the Dhamma taught by the Buddha." },
        { "no": "393", "verse": "Not by matted hair, nor by lineage, nor by birth does one become a holy man. But he in whom truth and righteousness exist – he is pure, he is a holy man." },
        { "no": "394", "verse": "What is the use of your matted hair, O witless man? What of your garment of antelope’s hide? Within you is the tangle (of passion); only outwardly do you cleanse yourself.", "footnote": "In the time of the Buddha, such ascetic practices as wearing matted hair and garments of hides were considered marks of holiness." },
        { "no": "395", "verse": "The person who wears a robe made of rags, who is lean, with veins showing all over the body, and who meditates alone in the forest – him do I call a holy man." },
        { "no": "396", "verse": "I do not call him a holy man because of his lineage or high-born mother. If he is full of impeding attachments, he is just a supercilious man. But who is free from impediments and clinging – him do I call a holy man." },
        { "no": "397", "verse": "He who, having cut off all fetters, trembles no more, who has overcome all attachments and is emancipated – him do I call a holy man." },
        { "no": "398", "verse": "He who has cut off the thong (of hatred), the band (of craving), and the rope (of false views), together with the appurtenances (latent evil tendencies), he who has removed the crossbar (of ignorance) and is enlightened – him do I call a holy man." },
        { "no": "399", "verse": "He who without resentment endures abuse, beating and punishment; whose power, real might, is patience – him do I call a holy man." },
        { "no": "400", "verse": "He who is free from anger, is devout, virtuous, without craving, self-subdued and bears his final body – him do I call a holy man." },
        { "no": "401", "verse": "Like water on a lotus leaf, or a mustard seed on the point of a needle, he who does not cling to sensual pleasures – him do I call a holy man." },
        { "no": "402", "verse": "He who in this very life realizes for himself the end of suffering, who has laid aside the burden and become emancipated – him do I call a holy man." },
        { "no": "403", "verse": "He who has profound knowledge, who is wise, skilled in discerning the right or wrong path, and has reached the highest goal – him do I call a holy man." },
        { "no": "404", "verse": "He who holds aloof from householders and ascetics alike, and wanders about with no fixed abode and but few wants – him do I call a holy man." },
        { "no": "405", "verse": "He who has renounced violence towards all living beings, weak or strong, who neither kills nor causes others to kill – him do I call a holy man." },
        { "no": "406", "verse": "He who is friendly amidst the hostile, peaceful amidst the violent, and unattached amidst the attached – him do I call a holy man." },
        { "no": "407", "verse": "He whose lust and hatred, pride and hypocrisy have fallen off like a mustard seed from the point of a needle – him do I call a holy man." },
        { "no": "408", "verse": "He who utters gentle, instructive and truthful words, who imprecates none – him do I call a holy man." },
        { "no": "409", "verse": "He who in this world takes nothing that is not given to him, be it long or short, small or big, good or bad – him do I call a holy man." },
        { "no": "410", "verse": "He who wants nothing of either this world or the next, who is desire-free and emancipated – him do I call a holy man." },
        { "no": "411", "verse": "He who has no attachment, who through perfect knowledge is free from doubts and has plunged into the Deathless – him do I call a holy man." },
        { "no": "412", "verse": "He who in this world has transcended the ties of both merit and demerit, who is sorrowless, stainless and pure – him do I call a holy man." },
        { "no": "413", "verse": "He, who, like the moon, is spotless and pure, serene and clear, who has destroyed the delight in existence – him do I call a holy man." },
        { "no": "414", "verse": "He who, having traversed this miry, perilous and delusive round of existence, has crossed over and reached the other shore; who is meditative, calm, free from doubt, and, clinging to nothing, has attained to Nibbana – him do I call a holy man." },
        { "no": "415", "verse": "He who, having abandoned sensual pleasures, has renounced the household life and become a homeless one; has destroyed both sensual desire and continued existence – him do I call a holy man." },
        { "no": "416", "verse": "He who, having abandoned craving, has renounced the household life and become a homeless one, has destroyed both craving and continued existence – him do I call a holy man." },
        { "no": "417", "verse": "He who, casting off human bonds and transcending heavenly ties, is wholly delivered of all bondages – him do I call a holy man." },
        { "no": "418", "verse": "He who, having cast off likes and dislikes, has become tranquil, is rid of the substrata of existence and like a hero has conquered all the worlds – him do I call a holy man." },
        { "no": "419", "verse": "He who in every way knows the death and rebirth of all beings, and is totally detached, blessed and enlightened – him do I call a holy man." },
        { "no": "420", "verse": "He whose track no gods, no angels, no humans trace, the arahant who has destroyed all cankers – him do I call a holy man." },
        { "no": "421", "verse": "He who clings to nothing of the past, present and future, who has no attachment and holds on to nothing – him do I call a holy man." },
        { "no": "422", "verse": "He, the Noble, the Excellent, the Heroic, the Great Sage, the Conqueror, the Passionless, the Pure, the Enlightened one – him do I call a holy man." },
        { "no": "423", "verse": "He who knows his former births, who sees heaven and hell, who has reached the end of births and attained to the perfection of insight, the sage who has reached the summit of spiritual excellence – him do I call a holy man." }
      ]
    }
  ]
}
